{
  "storyId": "story-003-cat-rescue",
  "sessionId": "d072e33e-f512-4ebf-b356-095307ad32b9",
  "selectedVersions": {},
  "regenerationCount": {},
  "lastUpdated": "2026-02-05T12:34:52.915Z",
  "characterDescription": {
    "ageRange": "30-35 years old",
    "skinTone": "light beige skin with warm, yellow undertones and extensive freckling across the face, concentrated on the nose, cheeks, and forehead. Slight redness around the nose and cheek area.",
    "eyeColor": "hazel green eyes with a golden brown center and darker green outer rim. Slight yellow/amber specks throughout the iris.",
    "eyeShape": "almond-shaped eyes, slightly downturned at the outer corners. Moderate eyelid exposure.",
    "hairColor": "dark brown near the roots transitioning to warm honey brown towards the ends with some subtle golden highlights. ",
    "hairTexture": "slightly wavy hair, appears smooth and somewhat fine. Hair has some natural shine.",
    "hairStyle": "long hair parted in the middle, falling loosely around the shoulders.",
    "faceShape": "oval face with slightly rounded cheeks and a defined jawline. Forehead is medium in height and width.",
    "nose": "medium-sized nose with a slightly bulbous, rounded tip. The bridge is straight.",
    "lips": "medium-sized lips, with the upper lip slightly thinner than the lower lip. Natural rose pink color.",
    "smile": "slight, closed-lip smile. No teeth are visible.",
    "eyebrows": "medium thick dark eyebrows, slightly arched shape. Dark brown in color, closely matching the hair color at the roots. ",
    "ears": "ears not completely visible.",
    "cheeks": "slightly rounded cheeks with freckles. No visible dimples.",
    "chin": "rounded chin, not overly prominent.",
    "facialProportions": "balanced facial proportions; eyes are approximately one eye-width apart. Nose takes up approximately one-third of the face's length.",
    "distinctiveFeatures": "Extensive freckling across the face and chest. Slight asymmetry to the face, with the left side appearing slightly fuller.",
    "overallImpression": "naturally beautiful and approachable appearance. Calm and pleasant expression.",
    "fullDescription": "This woman is in her early thirties with an oval face and a light beige complexion heavily freckled across her face, especially on her nose and cheeks. Her eyes are a hazel green with a golden brown center, framed by slightly downturned, almond-shaped eyes and medium-thick dark brown eyebrows. Her hair is long and slightly wavy, transitioning from dark brown roots to warm honey brown ends with subtle golden highlights, and is parted down the middle. She has medium-sized lips with a natural rose-pink color and a slightly bulbous nose that is proportionate to her overall facial structure.",
    "generatedAt": "2026-02-05T12:34:52.914Z"
  }
}