{
  "storyId": "story-003-cat-rescue",
  "sessionId": "161bd302-ce4a-42e3-a414-7b6c26f646ea",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-02-04T17:25:59.850Z",
      "imagePath": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-02-04T17:26:10.270Z",
      "imagePath": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-02-04T17:26:21.078Z",
      "imagePath": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-02-04T17:26:21.078Z",
  "characterDescription": {
    "ageRange": "5-6 years old",
    "skinTone": "Fair skin with subtle rosy undertones, slightly darker around the eyes, and a peachy hue on the cheeks.",
    "eyeColor": "Bright sky blue eyes with a slight greyish-blue hue, darker limbal ring.",
    "eyeShape": "Almond-shaped eyes, slightly downturned at the outer corners, with visible upper eyelids and short, sparse lashes.",
    "hairColor": "Medium chestnut brown with subtle natural lighter brown highlights and slightly auburn undertones near the ends.",
    "hairTexture": "Fine and slightly wavy hair with loose, springy curls and a tendency to frizz.",
    "hairStyle": "Hair is styled in two high buns on top of the head, secured with light pink clips and white pom poms. Shorter strands frame the face.",
    "faceShape": "Round face with full, slightly chubby cheeks and a soft, rounded jawline.",
    "nose": "Small, slightly upturned button nose with a subtle dip at the bridge.",
    "lips": "Medium-sized lips with a slightly fuller bottom lip, natural rose pink color with a hint of mauve.",
    "smile": "Neutral expression, so difficult to judge smile characteristics. Lips are closed. No teeth visible.",
    "eyebrows": "Light brown eyebrows, thinner in density, slightly arched shape, and a few stray hairs.",
    "ears": "Visible medium-sized ears, relatively close to the head, with delicate lobes.",
    "cheeks": "Full, round cheeks with a natural rosy blush and slightly visible cheekbones when angled.",
    "chin": "Rounded soft chin, slightly recessed in profile.",
    "facialProportions": "Eyes are large in proportion to the face size, nose and mouth are relatively small, and the forehead is proportionate to the rest of the face.",
    "distinctiveFeatures": "Slight darkness under the eyes, some shorter baby hairs along the hairline, very faint freckles across the nose.",
    "overallImpression": "A sweet and innocent appearance, with soft features and a slightly reserved demeanor. The styling of the hair adds to her playful charm.",
    "fullDescription": "This young girl appears to be approximately 5-6 years old, with fair skin that has rosy undertones and slightly darker areas under her bright sky blue eyes. Her medium chestnut brown hair, fine and slightly wavy, is styled in two high buns adorned with pink clips and white pom poms. Her face is round with full cheeks and a soft jawline, complemented by a small, upturned button nose and medium-sized rose pink lips. She has faint freckles scattered across her nose and light brown, slightly arched eyebrows, giving her a generally sweet and innocent look.",
    "generatedAt": "2026-02-04T17:25:49.808Z"
  },
  "styleReferenceImage": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T17:25:59.850Z",
        "imagePath": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T17:26:10.270Z",
        "imagePath": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T17:26:21.078Z",
        "imagePath": "data/sessions/161bd302-ce4a-42e3-a414-7b6c26f646ea/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}