{
  "id": "story-002-dragon-adventure",
  "version": "1.0.0",
  "title": {
    "es": "La Aventura del Dragón Amigable",
    "en": "The Friendly Dragon Adventure"
  },
  "description": {
    "es": "Una historia mágica sobre la amistad entre un niño y un dragón bebé que aparece en su jardín.",
    "en": "A magical story about the friendship between a child and a baby dragon that appears in their garden."
  },
  "metadata": {
    "author": "Mask Stories",
    "illustrationStyle": "highly-realistic-portrait-art-with-illustrated-background",
    "theme": "fantasy-friendship",
    "ageRange": {
      "min": 4,
      "max": 8
    },
    "estimatedReadingTime": 5,
    "tags": ["dragon", "magic", "friendship", "adventure", "fantasy"],
    "styleProfile": {
      "technique": "Highly realistic digital portrait painting for the child with soft artistic touches on background and fantasy elements. Professional portrait art quality merged with illustrated storybook environments.",
      "colorPalette": "Natural, accurate colors for the child (precise skin tones, hair colors). Vibrant, artistic colors for background - rich blues and purples for skies, lush greens for gardens, warm golden tones for sunsets.",
      "lineWork": "Minimal outlines on child - focus on realistic painted detail. Soft artistic outlines on background elements and fantasy creatures for stylistic contrast.",
      "texture": "Natural skin texture on child - smooth gradations, realistic detail, proper subsurface light effects. Painterly, artistic texture on backgrounds and fantasy elements (dragon, magical effects).",
      "lighting": "Cinematic, natural lighting on child - professional portrait painting lighting. Natural highlights, realistic shadows, proper light interaction with features. Background can have more artistic/stylized lighting.",
      "detailLevel": "Maximum detail and accuracy on child's portrait - face, hands, clothing painted with high realism. Background and fantasy elements more illustrated/painterly to create artistic contrast. Child rendered with portrait painting quality in a painted storybook world.",
      "atmosphere": "Magical realism - a highly realistic child portrait in a fantasy illustrated world. The child is painted with portrait accuracy; the world around them is more artistic/illustrated.",
      "artisticReferences": "High-end portrait painting composite art. Professional portrait quality child placed in painted fantasy scene. Similar to illustrated movie posters where characters have realistic detail in artistic environments."
    }
  },
  "pages": [
    {
      "pageNumber": 1,
      "baseImagePath": "base-images/page-01.jpg",
      "promptPath": "prompts/page-01.txt",
      "aspectRatio": "3:4",
      "metadata": {
        "title": {
          "es": "El Encuentro Mágico",
          "en": "The Magical Encounter"
        },
        "text": {
          "es": "Una mañana soleada, mientras jugaba en el jardín, {CHILD_NAME} escuchó un sonido extraño detrás de las flores. ¡Era un pequeño dragón bebé de escamas brillantes!",
          "en": "One sunny morning, while playing in the garden, {CHILD_NAME} heard a strange sound behind the flowers. It was a small baby dragon with shimmering scales!"
        },
        "sceneDescription": "A lush, vibrant garden on a sunny morning. Colorful flowers, green grass, a wooden fence in the background. A small, cute baby dragon with iridescent blue-purple scales peeking out from behind large sunflowers.",
        "emotionalTone": "surprise-and-wonder",
        "facePosition": {
          "x": 0.35,
          "y": 0.4,
          "description": "Child kneeling in the garden, turned slightly toward the dragon, expression of amazed discovery"
        },
        "timeOfDay": "morning",
        "difficulty": "medium"
      }
    },
    {
      "pageNumber": 2,
      "baseImagePath": "base-images/page-02.jpg",
      "promptPath": "prompts/page-02.txt",
      "aspectRatio": "3:4",
      "metadata": {
        "title": {
          "es": "Volando Entre Nubes",
          "en": "Flying Through Clouds"
        },
        "text": {
          "es": "El dragón creció de repente y le ofreció a {CHILD_NAME} un paseo mágico. Juntos volaron por encima de las nubes, sintiendo el viento en el rostro y la libertad en el corazón.",
          "en": "The dragon suddenly grew and offered {CHILD_NAME} a magical ride. Together they flew above the clouds, feeling the wind on their face and freedom in their heart."
        },
        "sceneDescription": "High above the clouds at sunset. The child is sitting on the dragon's back, flying through a sky painted in warm oranges, pinks, and purples. Fluffy white clouds below, sun setting on the horizon. The dragon is larger, majestic, with powerful wings spread wide.",
        "emotionalTone": "joy-and-excitement",
        "facePosition": {
          "x": 0.4,
          "y": 0.35,
          "description": "Child sitting on dragon's back, looking forward with an expression of pure joy and excitement, hair flowing in the wind"
        },
        "timeOfDay": "sunset",
        "difficulty": "hard"
      }
    },
    {
      "pageNumber": 3,
      "baseImagePath": "base-images/page-03.jpg",
      "promptPath": "prompts/page-03.txt",
      "aspectRatio": "3:4",
      "metadata": {
        "title": {
          "es": "Una Amistad Eterna",
          "en": "An Eternal Friendship"
        },
        "text": {
          "es": "Al caer la noche, el dragón debía regresar a su hogar mágico. {CHILD_NAME} le dio un abrazo de despedida, sabiendo que los verdaderos amigos siempre se encuentran de nuevo.",
          "en": "As night fell, the dragon had to return to its magical home. {CHILD_NAME} gave it a farewell hug, knowing that true friends always find each other again."
        },
        "sceneDescription": "A starry night sky with a magical portal glowing in the distance - swirling colors of purple, blue, and gold. The child is standing in the garden, waving goodbye to the dragon who is flying toward the portal. Fireflies and magical sparkles fill the air.",
        "emotionalTone": "bittersweet-but-hopeful",
        "facePosition": {
          "x": 0.3,
          "y": 0.5,
          "description": "Child standing, one hand raised in a wave, gentle smile mixed with a touch of sadness but mostly warmth and hope"
        },
        "timeOfDay": "night",
        "difficulty": "medium"
      }
    }
  ],
  "settings": {
    "maxRegenerations": 3,
    "defaultAspectRatio": "3:4",
    "geminiModel": "gemini-2.5-flash-image",
    "processingTimeout": 180,
    "imageQuality": {
      "compression": 90,
      "maxWidth": 1400,
      "maxHeight": 1867,
      "format": "png"
    },
    "faceSwapSettings": {
      "blendMode": "photorealistic-priority",
      "skinTexturePreservation": "maximum",
      "facialFeatureAccuracy": "highest",
      "lightingConsistency": "natural-cinematic"
    }
  }
}
