{
  "storyId": "story-002-dragon-adventure",
  "sessionId": "76b8aeb2-3603-4453-a0ac-b8474b7b56a4",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-01-10T10:27:35.576Z",
      "imagePath": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-01-10T10:27:48.613Z",
      "imagePath": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-01-10T10:27:59.026Z",
      "imagePath": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-01-10T10:27:59.026Z",
  "characterDescription": {
    "ageRange": "5-6 years old",
    "skinTone": "fair skin with cool pink undertones, especially visible on cheeks and forehead. Skin appears slightly translucent.",
    "eyeColor": "bright sky blue eyes with a darker blue limbal ring. The iris has slight grey undertones and fine darker striations emanating from the pupil.",
    "eyeShape": "large almond-shaped eyes, slightly downturned at the outer corners. Upper eyelids are slightly hooded, and lower eyelids have subtle puffiness.",
    "hairColor": "dark auburn brown with natural lighter reddish-brown highlights, especially noticeable where the hair is gathered into buns. Hair color is darker near the roots.",
    "hairTexture": "fine, soft hair with loose, natural waves and ringlets, especially around the face. Hair tends to frizz slightly, giving it a voluminous appearance.",
    "hairStyle": "hair styled into two high pigtail buns on top of the head, secured with pink clip-on accessories and white pom poms. Stray curls frame the face.",
    "faceShape": "round face with prominent, rounded cheeks and a soft, gently sloping jawline. Fullness in the lower face gives a cherubic appearance.",
    "nose": "small, slightly upturned button nose with a subtle curve at the bridge. Nostrils are small and gently rounded.",
    "lips": "full, rose-pink lips, with a slightly more pronounced upper lip. The cupid's bow is subtly defined. Lip color is slightly more intense along the vermillion border.",
    "smile": "Neutral expression, but there are hints of a wide smile. Teeth are not visible.",
    "eyebrows": "medium-thick eyebrows that are a shade darker than the hair color, following a slightly arched shape. Eyebrows are naturally shaped and not overly groomed.",
    "ears": "medium-sized ears that lie relatively close to the head. Earlobes are attached and rounded. The inner ear is visible and pale pink.",
    "cheeks": "full, round cheeks with a natural rosy blush. Cheeks are most prominent when smiling.",
    "chin": "soft, rounded chin that blends smoothly into the jawline. The chin is proportionate to the rest of the face.",
    "facialProportions": "large, expressive eyes that are the most prominent feature, small nose and mouth in proportion to the face. Forehead is slightly wider than the jawline, contributing to the roundness of the face.",
    "distinctiveFeatures": "a barely perceptible reddish birthmark or patch of slightly darker skin just above the left eyebrow, very fine blonde vellus hair visible on cheeks, slight gap visible between eyebrow hairs.",
    "overallImpression": "sweet and innocent appearance with youthful, baby-faced features. The child has an expressive face and a delicate beauty.",
    "fullDescription": "This young girl, estimated to be between 5 and 6 years old, has fair skin with cool pink undertones, most noticeable on her cheeks and forehead. Her bright sky blue eyes, framed by slightly downturned, almond-shaped lids, are her most prominent feature. Her hair is styled into two high pigtail buns with pink and white accessories, showcasing its dark auburn brown color with natural reddish highlights and soft, fine texture with loose waves. Her round face, characterized by full cheeks and a small upturned nose, is delicately proportionate, save for a barely perceptible reddish mark above her left eyebrow and vellus hairs on her cheeks, contributing to her sweet and innocent appearance.",
    "generatedAt": "2026-01-10T10:27:23.860Z"
  },
  "styleReferenceImage": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:27:35.576Z",
        "imagePath": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:27:48.613Z",
        "imagePath": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:27:59.026Z",
        "imagePath": "data/sessions/76b8aeb2-3603-4453-a0ac-b8474b7b56a4/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}