{
  "storyId": "story-003-cat-rescue",
  "sessionId": "554de7df-96db-423f-ac8a-c02889ea3ff4",
  "selectedVersions": {},
  "regenerationCount": {},
  "lastUpdated": "2026-02-05T12:38:47.676Z",
  "characterDescription": {
    "ageRange": "30-35 years old",
    "skinTone": "Light skin with warm undertones and extensive freckling across the face, especially concentrated on the nose, cheeks, and forehead. There are darker pigmentation spots on the right cheek. The skin appears slightly textured with some visible pores.",
    "eyeColor": "Hazel eyes with a prominent green hue and a darker brown limbal ring. There are slight amber flecks visible in the iris, especially in sunlight.",
    "eyeShape": "Almond-shaped eyes with a slightly downward tilt at the outer corners. The upper eyelids have a slight hooding effect. Sparse lashes.",
    "hairColor": "Dark auburn hair with natural lighter streaks concentrated towards the bottom ends, appearing sun-kissed. Hair near the roots is a darker chocolate brown.",
    "hairTexture": "Slightly wavy with natural volume and medium strand thickness. The hair appears smooth and well-conditioned, but not overly glossy.",
    "hairStyle": "Long, loose hair parted in the middle, cascading down past the shoulders. The hair is not styled or deliberately coiffed, with natural movement and waves.",
    "faceShape": "Oval face shape with slightly prominent cheekbones. The jawline is soft and moderately defined. The forehead is broad.",
    "nose": "Medium-sized nose with a slightly bulbous tip. The bridge is straight with a subtle dorsal hump. Nostrils are of average size.",
    "lips": "Medium-sized lips with a fuller bottom lip. The lip color is a natural rose shade, and the cupid's bow is well-defined. There is a very subtle smile playing on the lips.",
    "smile": "Closed-lip smile, conveying a calm and content expression. The teeth are not visible.",
    "eyebrows": "Medium-thick eyebrows with a slight arch. The hair color is dark brown, matching the darker shade of her hair roots. The eyebrows are well-groomed.",
    "ears": "Ears are not fully visible but appear to be medium-sized and positioned close to the head.",
    "cheeks": "Full cheeks with freckles distributed evenly. There is slight hollowness just below the cheekbones, giving definition to the face.",
    "chin": "Rounded chin with a smooth contour and no cleft.",
    "facialProportions": "Well-balanced facial proportions. The eyes are neither too close nor too far apart relative to face width. The nose occupies approximately one-third of the face's vertical length.",
    "distinctiveFeatures": "Extensive freckling across the entire face is the most prominent distinctive feature. There are also darker pigmentation spots present on the right cheek area. Some visible fine lines around the eyes and mouth.",
    "overallImpression": "A serene and natural appearance with a friendly and approachable demeanor. Her face conveys warmth and a sense of quiet confidence.",
    "fullDescription": "This woman, estimated to be in her early thirties, has a light skin tone with warm undertones and is extensively freckled across her face, giving her a sun-kissed appearance. She has hazel eyes with green hues and darker brown limbal rings, framed by almond-shaped eyes and medium-thick arched eyebrows. Her dark auburn hair, with lighter streaks towards the ends, is parted in the middle and worn long and loose. She has an oval face shape with full cheeks, a medium-sized nose with a slightly bulbous tip, and medium lips wearing a natural rose shade, along with some darker pigmentation spots on her right cheek. Her overall expression is calm and content, with a friendly and approachable demeanor.",
    "generatedAt": "2026-02-05T12:38:47.674Z"
  }
}