{
  "storyId": "story-003-cat-rescue",
  "sessionId": "f1381f06-ec88-423a-88b9-7c7030358f66",
  "selectedVersions": {},
  "regenerationCount": {},
  "lastUpdated": "2026-02-05T12:44:57.323Z",
  "characterDescription": {
    "ageRange": "30-35 years old",
    "skinTone": "Light to medium skin tone with golden and peach undertones, a high density of freckles across the entire face, especially concentrated on the nose bridge, cheeks, and forehead. Visible sun damage around the eyes and on the forehead.",
    "eyeColor": "Hazel eyes with a dominant light brown-green color and darker green ring on the outside, small flecks of gold near the pupil. The right eye (from viewer's perspective) appears to have slightly more brown in it.",
    "eyeShape": "Almond-shaped eyes, slightly downturned at the outer corners. There are visible fine lines and slight bags under the eyes.",
    "hairColor": "Dark brown hair with subtle lighter brown and auburn highlights, particularly noticeable toward the bottom of the hair shafts. The roots appear to be a deeper, richer dark brown.",
    "hairTexture": "Slightly wavy hair with a smooth, glossy texture. Appears relatively fine, possibly medium density.",
    "hairStyle": "Long hair, parted in the center and worn loose, falling past the shoulders.",
    "faceShape": "Oval face shape with a relatively balanced structure. Full cheeks with soft lines from the nose to the corners of the mouth are visible. The jawline is soft, but present.",
    "nose": "Medium-sized nose with a slightly rounded tip. The bridge is straight and blends smoothly into the forehead.",
    "lips": "Medium-sized lips with a natural pink hue. The upper lip appears slightly thinner than the lower lip. There is a slight natural pout to the lower lip.",
    "smile": "Closed-lip smile, expressing a calm and serene expression. No teeth are visible. The smile subtly lifts the cheeks, accentuating the cheekbones.",
    "eyebrows": "Medium-thick eyebrows, slightly arched shape with natural tapering towards the outer edges. The hair is dark brown, matching the root color of the hair. There is a small gap on the inner part of the right eyebrow.",
    "ears": "Not fully visible but appear to be of average size and set close to the head.",
    "cheeks": "Full cheeks with natural rosiness and visible freckles concentrated in this area. Slight hollowing under the cheekbones due to age.",
    "chin": "Rounded chin with a soft, gentle curve. The chin appears to be slightly recessed compared to the lips.",
    "facialProportions": "Balanced facial proportions, with the eyes, nose, and mouth harmoniously placed. The forehead is of average height, and the mid-face is the longest part of the face.",
    "distinctiveFeatures": "Extensive freckling across the entire face, varying in size and density. A couple of small red acne spots are visible on the chin and neck. Fine lines around the eyes and slight nasolabial folds indicating moderate aging, small mole on the neck",
    "overallImpression": "Mature, natural appearance with a calm and serene expression. The freckles give her a unique, individual look, and the slight signs of aging add character to her face.",
    "fullDescription": "This woman is in her early to mid-thirties with a light to medium skin tone richly freckled across her entire face, with a particular concentration on her nose, cheeks, and forehead. Her eyes are a complex hazel color with a dark green ring around the outside and slight amber flecks near the pupil, almond shaped with subtle fine lines underneath. She has long dark brown hair with natural highlights and a slight wave, parted in the center and worn loose. Her oval face is framed by medium-thick, slightly arched eyebrows and features a medium-sized nose with a rounded tip and medium lips held in a closed, calm smile, a mole on her neck.",
    "generatedAt": "2026-02-05T12:44:57.321Z"
  }
}