{
  "storyId": "story-001-first-day-school",
  "sessionId": "9cfa37c6-cfb5-488c-a10b-274b2f8fc55f",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-01-02T13:12:35.366Z",
      "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-01-02T13:12:50.195Z",
      "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-01-02T13:13:02.016Z",
      "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-03-v1.png"
    },
    "4": {
      "version": 1,
      "generatedAt": "2026-01-02T13:13:16.320Z",
      "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-04-v1.png"
    },
    "5": {
      "version": 1,
      "generatedAt": "2026-01-02T13:13:27.057Z",
      "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-05-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1,
    "4": 1,
    "5": 1
  },
  "lastUpdated": "2026-01-02T13:13:27.057Z",
  "characterDescription": {
    "ageRange": "6-7 years old",
    "skinTone": "Fair skin with warm pink undertones, concentrated rosiness on cheeks and tip of nose, slightly darker around the eyes, overall even complexion",
    "eyeColor": "Bright sky blue eyes with a darker limbal ring, subtle grey-blue depth towards the pupil",
    "eyeShape": "Almond-shaped eyes, slightly downturned at the outer corners giving a somewhat serious expression, well-defined eyelids",
    "hairColor": "Dark auburn brown with subtle reddish highlights catching the light, slightly lighter brown near the hairline",
    "hairTexture": "Medium-fine hair texture with natural waves and loose curls, slightly frizzy around the face",
    "hairStyle": "Styled into two high pigtail buns on either side of the head, secured with light pink clips with white pom-poms, loose curly strands framing the face",
    "faceShape": "Round face with soft, full cheeks, a gently rounded jawline, and a proportionally small forehead",
    "nose": "Small, slightly upturned nose with a rounded tip, nostrils not particularly flared",
    "lips": "Full, naturally rosy pink lips, the bottom lip slightly fuller than the top, subtly defined cupid's bow",
    "smile": "Currently neutral expression, but based on the lip shape, the smile likely involves a slight upturn at the corners, without showing teeth",
    "eyebrows": "Medium-thick eyebrows, slightly darker than the hair color, straight and gently sloping upwards towards the outer corners",
    "ears": "Visible ears, medium-sized and positioned fairly close to the head, with clearly defined helix and lobule",
    "cheeks": "Round and full cheeks with a natural flush of rosy pink, appearing slightly pinched in this neutral expression",
    "chin": "Rounded, soft chin that blends smoothly into the jawline",
    "facialProportions": "Eyes are large and prominent in relation to the face, nose is small and proportionally appropriate, mouth is a moderate size. The forehead appears small relative to the midface.",
    "distinctiveFeatures": "Slightly darker circles under the eyes, especially visible on the left eye. Small hand with a light blue ink stain on the knuckles. Loose curly hair strands around the face.",
    "overallImpression": "A sweet and slightly serious-looking child with baby-faced features and an innocent expression, enhanced by the high pigtails and rosy complexion",
    "fullDescription": "This is a 6-7 year old child with fair skin, rosy cheeks and warm pink undertones. Her bright sky blue eyes, slightly downturned at the outer corners, are framed by medium-thick, dark auburn-brown hair styled in two high pigtail buns. She has a round face with soft, full cheeks, a small upturned nose, and full, naturally rosy pink lips. Look for the slightly darker circles under her eyes and the light blue ink stain on her knuckles as unique identifying marks, as well as the slightly frizzy loose strands of curly auburn hair framing her face.",
    "generatedAt": "2026-01-02T13:12:23.799Z"
  },
  "styleReferenceImage": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-01-02T13:12:35.366Z",
        "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-01-02T13:12:50.195Z",
        "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-01-02T13:13:02.016Z",
        "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-03-v1.png"
      }
    ],
    "4": [
      {
        "version": 1,
        "generatedAt": "2026-01-02T13:13:16.320Z",
        "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-04-v1.png"
      }
    ],
    "5": [
      {
        "version": 1,
        "generatedAt": "2026-01-02T13:13:27.057Z",
        "imagePath": "data/sessions/9cfa37c6-cfb5-488c-a10b-274b2f8fc55f/generated/page-05-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}