{
  "storyId": "story-001-first-day-school",
  "sessionId": "490ef93b-b26f-48c6-957c-65b0033e0cc7",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-02-04T13:30:27.646Z",
      "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-02-04T13:30:39.994Z",
      "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-02-04T13:30:50.758Z",
      "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-03-v1.png"
    },
    "4": {
      "version": 1,
      "generatedAt": "2026-02-04T13:31:03.483Z",
      "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-04-v1.png"
    },
    "5": {
      "version": 1,
      "generatedAt": "2026-02-04T13:31:16.488Z",
      "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-05-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1,
    "4": 1,
    "5": 1
  },
  "lastUpdated": "2026-02-04T13:31:16.488Z",
  "characterDescription": {
    "ageRange": "5-6 years old",
    "skinTone": "Fair skin with slight pink undertones, particularly visible on the cheeks. Complexion is generally even with a very slight redness around the nose.",
    "eyeColor": "Bright sky blue eyes with a darker limbal ring. Subtle gray undertones closer to the pupils. Appears almost translucent.",
    "eyeShape": "Almond-shaped eyes, slightly downturned at the outer corners, giving a thoughtful expression. Eyelids are slightly hooded. Dark circles are present underneath the eyes.",
    "hairColor": "Medium brown, with warm auburn undertones noticeable in direct light. Natural highlights of slightly lighter brown are scattered throughout.",
    "hairTexture": "Wavy hair with defined curls towards the ends, especially around the face. Fine to medium strands with good volume. Some frizz is visible.",
    "hairStyle": "Hair is styled in two high pigtails/buns on either side of the head, secured with pink and white fluffy clip-ons. Stray hairs frame the face. Bangs are not present.",
    "faceShape": "Round face with soft features. Full, rounded cheeks contribute to a cherubic appearance. Jawline is soft and not strongly defined.",
    "nose": "Small, slightly upturned nose with a rounded tip. The bridge of the nose is narrow and delicate. Nostrils are small and not prominently flared.",
    "lips": "Naturally pink lips, with a slightly fuller bottom lip than top lip. The cupid's bow is gently defined. The mouth is small relative to the size of the face.",
    "smile": "Neutral expression, not smiling. The teeth are not visible. The corners of the mouth are slightly downturned, suggesting a contemplative mood.",
    "eyebrows": "Medium-thickness eyebrows, slightly darker than the hair color, with a naturally arched shape. The eyebrows are well-groomed but not overly shaped.",
    "ears": "Ears are mostly concealed by the hair but appear to be medium-sized and set close to the head. The earlobes appear small.",
    "cheeks": "Full, round cheeks with a natural rosy hue, especially prominent. No dimples are visible.",
    "chin": "Rounded, soft chin that blends seamlessly into the jawline. Not a prominent or pointed chin.",
    "facialProportions": "Eyes are proportionally large for the face size, contributing to a youthful look. The nose and mouth are relatively small. The forehead appears moderate in height.",
    "distinctiveFeatures": "Slight redness/irritation around the nose. Dark circles are visible under the eyes. Warm auburn highlights are present in the brown hair, particularly in sunlight. No obvious freckles or moles are visible.",
    "overallImpression": "A sweet and slightly serious little girl with innocent features. Her round face and bright blue eyes give her a captivating and youthful appearance. Her styling choices contribute to an overall impression of youthfulness.",
    "fullDescription": "This 5-6-year-old girl has fair skin with subtle pink undertones, bright sky blue eyes with darker limbal rings, and medium brown wavy hair styled into two high pigtails with pink and white fluffy clip-ons. Her face is round with full cheeks and a soft jawline, while her nose is small and slightly upturned. Her naturally pink lips, slightly fuller on the bottom, are presently set in a neutral expression. Distinctive features include a very slight redness around her nose, warm auburn highlights scattered throughout her medium brown hair, and dark circles underneath her eyes, contributing to her sweet but thoughtful appearance.",
    "generatedAt": "2026-02-04T13:30:16.731Z"
  },
  "styleReferenceImage": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T13:30:27.646Z",
        "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T13:30:39.994Z",
        "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T13:30:50.758Z",
        "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-03-v1.png"
      }
    ],
    "4": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T13:31:03.483Z",
        "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-04-v1.png"
      }
    ],
    "5": [
      {
        "version": 1,
        "generatedAt": "2026-02-04T13:31:16.488Z",
        "imagePath": "data/sessions/490ef93b-b26f-48c6-957c-65b0033e0cc7/generated/page-05-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}