{
  "locale": "es",
  "pages": [
    {
      "pageNumber": 1,
      "title": "Llegando a la escuela",
      "text": "Era una mañana muy especial para {childName}. El sol brillaba y los pájaros cantaban mientras caminaba hacia la escuela por primera vez. Su mochila nueva rebotaba en su espalda llena de cuadernos y colores. El corazón de {childName} latía rápido, entre emoción y un poquito de nervios."
    },
    {
      "pageNumber": 2,
      "title": "Conociendo el aula",
      "text": "Al entrar al salón, {childName} descubrió un mundo lleno de colores y sorpresas. La maestra le dio la bienvenida con una sonrisa cálida. Había mesas pequeñas, sillas de colores y muchos juguetes. {childName} miró a su alrededor con ojos muy grandes, emocionado por todas las aventuras que le esperaban."
    },
    {
      "pageNumber": 3,
      "title": "Aprendiendo cosas nuevas",
      "text": "{childName} levantó la mano para responder una pregunta. La maestra estaba muy orgullosa. Juntos aprendieron los números, las letras y canciones divertidas. {childName} descubrió que aprender era como jugar, y que cada día en la escuela sería una nueva aventura."
    },
    {
      "pageNumber": 4,
      "title": "Haciendo nuevos amigos",
      "text": "En el recreo, {childName} corrió al patio con sus nuevos amigos. Jugaron a las escondidas, saltaron la cuerda y se rieron mucho. {childName} ya no sentía nervios, solo alegría. Había encontrado compañeros para compartir juegos y aventuras."
    },
    {
      "pageNumber": 5,
      "title": "De vuelta a casa",
      "text": "Cuando sonó la campana, {childName} corrió a abrazar a mamá y papá. Tenía tantas cosas que contar: la maestra bondadosa, los nuevos amigos, los colores y las canciones. {childName} sonrió pensando en volver mañana. El primer día de escuela había sido mágico."
    }
  ],
  "cover": {
    "title": "Mi Primer Día de Escuela",
    "subtitle": "Un cuento personalizado para",
    "tagline": "Una aventura llena de descubrimientos"
  },
  "backCover": {
    "message": "Este cuento fue creado especialmente para {childName}, con amor y magia digital.",
    "footer": "Fin"
  }
}
