{
  "storyId": "story-002-dragon-adventure",
  "sessionId": "c923c559-a6bf-4dc1-9265-b16e67f0f619",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-01-10T10:26:30.638Z",
      "imagePath": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-01-10T10:26:44.762Z",
      "imagePath": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-01-10T10:27:01.604Z",
      "imagePath": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-01-10T10:27:01.604Z",
  "characterDescription": {
    "ageRange": "7-8 years old",
    "skinTone": "Light olive skin with subtle warm undertones, a slight natural flush on the cheeks and nose bridge, and even complexion with minimal visible blemishes.",
    "eyeColor": "Bright cerulean blue with a slightly darker limbal ring and faint hints of gray towards the center iris, appearing vibrant and clear.",
    "eyeShape": "Almond-shaped eyes, with a slightly downturned outer corner giving a thoughtful expression; medium-length eyelashes that are not particularly thick.",
    "hairColor": "Medium warm brown with natural subtle auburn highlights, especially noticeable in sunlight; new growth at the roots appears slightly darker.",
    "hairTexture": "Slightly wavy hair with medium thickness, exhibiting a natural texture with a slight tendency to frizziness, especially when pulled back. It appears relatively soft to the touch.",
    "hairStyle": "Varied. In some photos, the hair is long, loose, and slightly tousled. In another photo, it's styled into two high buns secured with pink accessories.",
    "faceShape": "Oval face shape with a gently rounded forehead and soft, subtly defined cheekbones; a gently tapering jawline leading to a softly rounded chin.",
    "nose": "Small to medium-sized nose with a straight bridge and a gently rounded tip; nostrils are moderately sized and slightly upturned.",
    "lips": "Medium-sized lips with a naturally rosy pink hue; the upper lip is slightly thinner than the lower lip, with a subtly defined Cupid's bow.",
    "smile": "When smiling widely, the child shows most of their upper teeth, which exhibit a visible gap between the two front teeth; the smile reveals a natural and genuine joy.",
    "eyebrows": "Medium-thick eyebrows, slightly arched with a soft, natural shape, closely matching the hair color; well-groomed but not overly defined.",
    "ears": "Medium-sized ears positioned relatively close to the head; earlobes are attached.",
    "cheeks": "Full, round cheeks giving a youthful appearance, exhibiting a slight natural rosiness that becomes more pronounced when smiling.",
    "chin": "Softly rounded chin that is proportionate to the face, neither overly prominent nor receding.",
    "facialProportions": "Balanced facial proportions, with features harmoniously spaced; the eyes are proportionally sized relative to the face, and the nose and mouth are neither too large nor too small.",
    "distinctiveFeatures": "A noticeable gap between the upper central incisors (front teeth); a very faint barely visible freckle or mole (very subtle) on the right side of the face; occasional flyaway strands of hair.",
    "overallImpression": "A sweet and cheerful appearance, characterized by bright eyes, a genuine smile, and a youthful exuberance; she possesses an approachable and friendly demeanor.",
    "fullDescription": "This child is a 7-8-year-old girl with light olive skin, a slight blush on her cheeks, and bright cerulean blue almond-shaped eyes. Her medium warm brown hair, with subtle auburn highlights, is styled differently across images, sometimes loose and wavy, other times in high buns. She has an oval face shape with soft features and a medium-sized nose with a slightly upturned tip. A distinctive gap between her upper front teeth is visible when she smiles, adding to her youthful and endearing charm. One very faint freckle may be present on the right side of her face.",
    "generatedAt": "2026-01-10T10:26:13.696Z"
  },
  "styleReferenceImage": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:26:30.638Z",
        "imagePath": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:26:44.762Z",
        "imagePath": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:27:01.604Z",
        "imagePath": "data/sessions/c923c559-a6bf-4dc1-9265-b16e67f0f619/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}