{
  "storyId": "story-002-dragon-adventure",
  "sessionId": "a6c44dda-5d84-4172-a950-7e4030e8f6e9",
  "selectedVersions": {},
  "regenerationCount": {},
  "lastUpdated": "2026-01-10T10:06:06.596Z",
  "characterDescription": {
    "ageRange": "7-8 years old",
    "skinTone": "Light olive skin with neutral undertones, slightly more rosy cheeks and around the nose",
    "eyeColor": "Bright sky blue eyes with a subtle darker blue limbal ring",
    "eyeShape": "Almond-shaped eyes, slightly downturned at outer corners, with average length eyelashes",
    "hairColor": "Medium ash brown with subtle auburn undertones, and natural lighter highlights in the crown of the head",
    "hairTexture": "Slightly wavy with natural volume, medium-thick strands",
    "hairStyle": "Often worn down past shoulders with face-framing layers, or styled in two high messy space buns",
    "faceShape": "Oval face with soft features, a moderately high forehead, and slight fullness in the cheeks",
    "nose": "Small, slightly upturned button nose with a rounded tip and subtly defined nostrils",
    "lips": "Naturally full lips, with the top lip slightly thinner than the bottom lip. A natural rose pink in color",
    "smile": "Wide open smile with a visible slight gap between the top front teeth",
    "eyebrows": "Medium-thick eyebrows, slightly arched, and a shade or two darker than her hair color",
    "ears": "Medium-sized ears that lie relatively close to the head",
    "cheeks": "Soft, moderately full cheeks with a natural flush of rosiness",
    "chin": "Slightly rounded chin, not particularly prominent",
    "facialProportions": "Balanced facial proportions, with the eyes positioned slightly wide-set relative to the nose width",
    "distinctiveFeatures": "A noticeable gap between the two upper front teeth. The bridge of the nose has faint freckling across it. The ears have attached earlobes.",
    "overallImpression": "Energetic and expressive appearance with a sweet and slightly mischievous look. She has classic, youthful features and a generally healthy complexion.",
    "fullDescription": "This child appears to be between 7 and 8 years old, with light olive skin and bright sky blue, almond-shaped eyes that are slightly downturned. Her medium ash brown hair, naturally wavy and voluminous, is often styled down or in space buns. She has a small, slightly upturned button nose and naturally full lips, revealing a slight gap between her top front teeth when she smiles widely. Her oval face shape is complemented by soft, rosy cheeks and medium-thick eyebrows, a shade or two darker than her hair. Her distinctive features include faint freckling across her nose bridge and attached earlobes.",
    "generatedAt": "2026-01-10T10:06:06.594Z"
  }
}