{
  "storyId": "story-003-cat-rescue",
  "sessionId": "b7a8f6bd-95e7-45b7-b64a-3569d309741b",
  "selectedVersions": {},
  "regenerationCount": {},
  "lastUpdated": "2026-02-05T12:28:40.369Z",
  "characterDescription": {
    "ageRange": "30-35 years old",
    "skinTone": "Light to medium olive skin with warm undertones and a natural matte finish. There's visible sun exposure causing a slight tan, with some freckles concentrated across the nose bridge and upper cheeks.",
    "eyeColor": "Medium brown eyes with darker limbal rings and subtle lighter brown flecks detectable up close. The eyes have a depth that gives them a warm appearance.",
    "eyeShape": "Almond-shaped eyes that are slightly downturned at the outer corners, with a natural crease above the eyelids. The upper eyelids have a more pronounced fold, giving the eyes a slight hooded appearance.",
    "hairColor": "Dark chestnut brown hair with subtle natural highlights, particularly around the face and towards the ends. The color has depth and richness.",
    "hairTexture": "Soft wavy hair with a slight natural bend. It appears to be of medium thickness and density.",
    "hairStyle": "Long hair, worn loose, falling just past the shoulders. It's parted slightly off-center, towards the left side.",
    "faceShape": "Oval face with balanced proportions, a slightly more prominent forehead, and soft, rounded cheeks. The jawline is softly defined.",
    "nose": "Medium-sized nose with a straight bridge and a rounded tip. The nostrils are subtly flared.",
    "lips": "Fuller lips, particularly the bottom lip, with a natural rosy pink color. The upper lip is slightly thinner than the bottom lip.",
    "smile": "Warm, genuine smile, revealing the upper teeth. The teeth appear naturally white and straight.",
    "eyebrows": "Medium-thick eyebrows with a natural arch, slightly tapered towards the outer edges. The color is a shade darker than the hair color.",
    "ears": "Ears are of medium size and positioned close to the head, mostly obscured by hair.",
    "cheeks": "Rounded cheeks that are full and soft, with a subtle blush of color, especially when smiling.",
    "chin": "Rounded chin with a smooth curve.",
    "facialProportions": "Harmonious facial proportions with balanced features. The eyes are spaced a comfortable distance apart, and the nose is proportional to the rest of the face.",
    "distinctiveFeatures": "Freckles scattered across the nose bridge and upper cheeks. There's a faint indentation or line visible above the left eyebrow. The presence of a beauty mark beneath the left side of her lower lip.",
    "overallImpression": "Mature, friendly, and approachable appearance with a warm and inviting smile. Overall impression of a kind and genuine individual.",
    "fullDescription": "The subject is a woman aged 30-35 with light to medium olive skin displaying subtle sun exposure and freckles across the nose and upper cheeks. Her medium brown almond-shaped eyes are slightly downturned, accentuated by dark chestnut brown wavy hair that falls to her shoulders, parted off-center to the left. She has an oval face with full, soft cheeks and a softly rounded chin. A medium-sized nose with a straight bridge complements her fuller, rosy pink lips, which she reveals in a warm smile exposing naturally straight teeth. The most distinctive features are the scattered freckles and a beauty mark beneath the left side of her lower lip; her overall appearance is friendly, genuine, and mature.",
    "generatedAt": "2026-02-05T12:28:40.368Z"
  }
}