{
  "storyId": "story-003-cat-rescue",
  "sessionId": "3b77be88-ef4f-4351-8858-8d5ba7787df4",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-02-05T11:49:16.055Z",
      "imagePath": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-02-05T11:49:26.694Z",
      "imagePath": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-02-05T11:49:37.340Z",
      "imagePath": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-02-05T11:49:37.340Z",
  "characterDescription": {
    "ageRange": "5-6 years old",
    "skinTone": "fair skin with subtle pink undertones, especially noticeable on cheeks and forehead. Even complexion with minimal visible blemishes.",
    "eyeColor": "light sky blue eyes with a slightly darker limbal ring around the iris. There are barely visible lighter almost grayish-white specks in the iris itself. Eyes are very vibrant.",
    "eyeShape": "almond-shaped eyes, with a slight downward tilt at the outer corners, giving a gentle expression. The upper eyelid has a subtle fold and the lower eyelid appears slightly puffy.",
    "hairColor": "dark auburn-brown hair with natural lighter highlights that catch the light. The roots appear slightly darker, indicating a richer, deeper brown.",
    "hairTexture": "fine, slightly wavy hair with soft, loose curls particularly around the face. The overall density appears medium.",
    "hairStyle": "hair is styled into two high pigtail buns on top of the head, secured with pink alligator clips adorned with small white pom-poms. Some loose strands frame the face, creating a slightly messy, playful look.",
    "faceShape": "oval face with a rounded forehead and soft, slightly chubby cheeks. The jawline is soft and not particularly defined.",
    "nose": "small, delicate nose with a slightly upturned tip. The bridge is straight and narrow, fitting proportionally with the rest of the face.",
    "lips": "naturally pink lips, with a slightly fuller bottom lip than top lip. The mouth is small and well-defined, giving a sweet expression.",
    "smile": "no visible smile, but the lips are slightly pursed, creating a thoughtful expression. The teeth are not visible.",
    "eyebrows": "medium-thick eyebrows, slightly darker than the hair color. They have a naturally arched shape and are well-groomed.",
    "ears": "visible left ear is medium-sized and set close to the head. The lobe is attached.",
    "cheeks": "full, rounded cheeks with a slight rosiness, giving a youthful appearance. The cheeks are prominent and contribute to the overall sweetness of the face.",
    "chin": "rounded, soft chin that blends seamlessly into the jawline. It is neither pointed nor particularly prominent.",
    "facialProportions": "balanced facial proportions, with eyes taking up a significant portion of the upper face. The nose is small relative to the rest of the face, and the mouth is proportionately sized.",
    "distinctiveFeatures": "subtle, very light freckles are barely visible across the bridge of the nose. The slight puffiness under the eyes adds to the youthful appearance. The overall look conveys innocence and a touch of seriousness.",
    "overallImpression": "a sweet and innocent child with a slightly serious expression. The light blue eyes and auburn hair create a striking contrast. Her overall appearance is charming and endearing.",
    "fullDescription": "This child is a 5-6 year old girl with fair skin and subtle pink undertones, most noticeable on her cheeks. Her light sky blue eyes, with their dark limbal rings, are almond-shaped and slightly downturned at the corners. Her dark auburn-brown hair is styled in two high pigtail buns with pink pom-pom clips, framing her oval face with its soft, slightly chubby cheeks. Her small, delicate nose has a slightly upturned tip, and her naturally pink lips are slightly pursed in a thoughtful expression. With her barely visible freckles across her nose bridge and a slight puffiness under her eyes, her features combine to give her a sweet, innocent, and slightly serious appearance.",
    "generatedAt": "2026-02-05T11:49:06.987Z"
  },
  "styleReferenceImage": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-02-05T11:49:16.055Z",
        "imagePath": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-02-05T11:49:26.694Z",
        "imagePath": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-02-05T11:49:37.340Z",
        "imagePath": "data/sessions/3b77be88-ef4f-4351-8858-8d5ba7787df4/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}