{
  "storyId": "story-003-cat-rescue",
  "sessionId": "71df6431-1289-4d75-a132-fa0dbeebb2f6",
  "selectedVersions": {},
  "regenerationCount": {},
  "lastUpdated": "2026-02-05T12:40:46.312Z",
  "characterDescription": {
    "ageRange": "30-35 years old",
    "skinTone": "Light to medium beige skin tone with warm undertones, heavily freckled across the face, particularly concentrated on the nose and cheeks, slight redness around the nose and inner corner of the eyes.",
    "eyeColor": "Hazel eyes, with a distinct gradient from olive green in the center to warm brown around the outer edge. Visible darker limbal ring.",
    "eyeShape": "Almond-shaped eyes, slightly downturned at the outer corners. Average eyelid exposure.",
    "hairColor": "Dark brown hair with subtle warm brown highlights, especially near the ends. Appears to have natural lightening.",
    "hairTexture": "Straight hair with slight natural wave, particularly noticeable towards the ends.",
    "hairStyle": "Long hair, parted slightly off-center, falling loosely down the shoulders. Framing the face.",
    "faceShape": "Oval face shape with soft, rounded jawline. Forehead is moderate in height and width.",
    "nose": "Medium-sized nose with a slightly rounded tip and a nearly straight bridge. Nostrils are small and subtle.",
    "lips": "Medium-fullness lips, the upper lip is slightly thinner than the lower lip. Natural rose color with no visible lipstick.",
    "smile": "Closed-lip smile with slight upturn at the corners of the mouth. Expression is warm and gentle.",
    "eyebrows": "Medium thickness eyebrows, slightly arched shape following the brow bone, dark brown color matching the hair color. Well-groomed but natural.",
    "ears": "Ears are not fully visible in the photo.",
    "cheeks": "Cheeks are slightly full and have natural rosiness, especially noticeable due to the freckles.",
    "chin": "Rounded, slightly soft chin with no cleft or dimple.",
    "facialProportions": "Balanced facial proportions overall. The nose is approximately one-third of the face length. The eyes are moderately spaced and proportional to the other features.",
    "distinctiveFeatures": "Very dense freckling across the entire face, including forehead, nose, cheeks, and around the mouth. Slight asymmetry to the eyebrow arch, the left being slightly higher. Subtle fine lines around the eyes. Some freckles also on the neck.",
    "overallImpression": "Natural and approachable appearance, conveying warmth and gentleness. The freckles are a defining characteristic, contributing to a youthful and radiant look.",
    "fullDescription": "This woman has a light to medium beige skin tone heavily freckled across her entire face with concentrations on her nose and cheeks. Her hazel eyes feature a dark limbal ring with a transition from olive green to warm brown, and are almond-shaped with slightly downturned corners. Her dark brown hair with warm brown highlights frames her oval face, which is shaped with a soft jawline, and styled long past the shoulders. She has a medium nose with a rounded tip and her lips are moderately full with a natural rose color, showing a gentle closed-lip smile. Finally, medium thick, slightly arched dark brown eyebrows compliment her freckled facial features",
    "generatedAt": "2026-02-05T12:40:46.310Z"
  }
}