{
  "storyId": "story-002-dragon-adventure",
  "sessionId": "5303bb76-54ab-42b1-8e3e-9f30ac982d52",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-01-10T10:19:50.936Z",
      "imagePath": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-01-10T10:20:07.529Z",
      "imagePath": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-01-10T10:20:22.971Z",
      "imagePath": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-01-10T10:20:22.971Z",
  "characterDescription": {
    "ageRange": "7-8 years old",
    "skinTone": "Light skin with slightly warm undertones, a hint of rosiness in the cheeks and around the nose. Skin appears fair but not porcelain, with a natural healthy glow.",
    "eyeColor": "Bright, clear blue eyes with a slight darker blue limbal ring. The irises have subtle darker speckles that are more visible closer to the pupil.",
    "eyeShape": "Almond-shaped eyes, slightly downturned at the outer corners giving a thoughtful expression. Moderate sized eyes relative to the face.",
    "hairColor": "Medium brown hair with noticeable warm chestnut tones, particularly visible in direct light. There are subtle natural highlights that make some strands appear lighter brown.",
    "hairTexture": "Slightly wavy hair with a medium density. The hair seems soft and manageable, with a tendency to frizz slightly at the ends, especially around the face.",
    "hairStyle": "Hair varies in photos: sometimes long, loosely styled, and other times styled into high pigtails, creating two small buns on top of the head. Fringes and wisps of hair around the hairline give it a slightly undone look.",
    "faceShape": "Oval face with a slightly rounded forehead and a gently tapering jawline. Cheeks are full and contribute to a youthful appearance.",
    "nose": "Small to medium-sized nose with a slightly rounded tip. The bridge is straight and the nostrils are proportionate to the overall size of the nose.",
    "lips": "Medium-sized lips with a well-defined Cupid's bow on the upper lip. The lips have a natural pink hue, slightly deeper on the lower lip. The bottom lip is fuller than the top lip.",
    "smile": "Wide, expressive smile revealing upper teeth and a visible gap between the two front teeth. Her smile brightens her entire face and gives her a cheerful appearance.",
    "eyebrows": "Medium-thickness eyebrows with a slightly arched shape. The color is slightly darker than the hair, giving a subtle contrast. They are well-groomed but retain a natural appearance.",
    "ears": "Ears are medium-sized and appear to lie relatively close to the head. The earlobes are attached.",
    "cheeks": "Full cheeks with subtle rosiness, especially prominent when smiling. No visible dimples.",
    "chin": "Rounded chin with a smooth contour. The chin is proportionate to the rest of the face.",
    "facialProportions": "Balanced facial proportions with eyes, nose and mouth in harmonious relation to each other. The forehead is a good size in proportion to the rest of her face. Her features are very age appropriate.",
    "distinctiveFeatures": "A noticeable gap between the front two upper teeth is a distinguishing feature. She also has slight natural shadows under her eyes. Her ears appear to be attached.",
    "overallImpression": "A bright and cheerful child with a friendly, open face. Her expressive eyes and toothy grin give her an engaging presence. She has a sweet and innocent appearance typical of her age.",
    "fullDescription": "This 7-8 year old girl has a light complexion with subtly warm undertones and naturally rosy cheeks. She has striking clear blue, almond-shaped eyes. Her medium brown hair, often styled in pigtails, has warm chestnut tones and a slight wave. She has an oval face with full cheeks, a small to medium nose with a rounded tip, and a mouth with a well-defined cupid's bow. Her most distinctive feature is the noticeable gap between her front two upper teeth which is revealed by her joyful, wide smile.",
    "generatedAt": "2026-01-10T10:19:35.700Z"
  },
  "styleReferenceImage": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:19:50.936Z",
        "imagePath": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:20:07.529Z",
        "imagePath": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:20:22.971Z",
        "imagePath": "data/sessions/5303bb76-54ab-42b1-8e3e-9f30ac982d52/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}