{
  "storyId": "story-003-cat-rescue",
  "sessionId": "79944297-d81b-4d60-b7f6-8d9a56be90bd",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-02-05T13:19:42.003Z",
      "imagePath": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-02-05T13:19:51.815Z",
      "imagePath": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-02-05T13:20:01.207Z",
      "imagePath": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-02-05T13:20:01.207Z",
  "characterDescription": {
    "ageRange": "5-6 years old",
    "skinTone": "fair skin with subtle pink undertones, especially noticeable on the cheeks. There's a slight unevenness in tone around the eyes and nose.",
    "eyeColor": "bright, clear blue eyes with a slightly darker limbal ring. No visible flecks.",
    "eyeShape": "large, slightly almond-shaped eyes with a very subtle downturned outer corner. Upper eyelids are partially hooded.",
    "hairColor": "medium chestnut brown with subtle lighter brown highlights and reddish undertones. The hair closer to the scalp appears slightly darker.",
    "hairTexture": "naturally wavy hair with some loose curls and frizziness. The texture appears soft and fine. Hair is of medium density.",
    "hairStyle": "hair styled in two high pigtails, secured with pink hair ties and white pom-pom clips. Bangs are thin and softly curled, just grazing the eyebrows.",
    "faceShape": "round face with full, prominent cheeks. Soft jawline and a rounded forehead.",
    "nose": "small, slightly upturned nose with a rounded tip. The bridge is slightly sloped.",
    "lips": "full, well-defined lips with a natural pink color. The bottom lip appears slightly fuller than the upper lip.",
    "smile": "no smile present. Lips are closed in a neutral expression.",
    "eyebrows": "medium-thick eyebrows, a shade darker than the hair color. They are naturally arched and softly defined.",
    "ears": "medium-sized ears that are mostly obscured by hair, but appear to be close-set to the head.",
    "cheeks": "full and round cheeks with a natural rosiness, creating a youthful appearance.",
    "chin": "rounded, slightly receding chin.",
    "facialProportions": "large eyes relative to face size. Small nose and mouth. The lower face is slightly shorter compared to the upper face.",
    "distinctiveFeatures": "a small indentation above the right eyebrow. Slight dark circles under the eyes. Faint line of hair on the forehead.",
    "overallImpression": "sweet and innocent appearance, youthful baby-faced features. Appears thoughtful or slightly serious.",
    "fullDescription": "This is a 5-6 year old girl with a sweet, innocent face. She has fair skin with subtle pink undertones, large, bright blue eyes with a slightly downturned outer corner and medium chestnut brown wavy hair styled in two high pigtails secured with pink hair ties and white pom-pom clips. Her face is round with full cheeks and a rounded, slightly receding chin. She has a small, slightly upturned nose and full, well-defined pink lips. A small indentation is visible above her right eyebrow and there are faint dark circles under her eyes, and thin, lightly curled bangs that just graze the eyebrows.",
    "generatedAt": "2026-02-05T13:19:31.546Z"
  },
  "styleReferenceImage": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-02-05T13:19:42.003Z",
        "imagePath": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-02-05T13:19:51.815Z",
        "imagePath": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-02-05T13:20:01.207Z",
        "imagePath": "data/sessions/79944297-d81b-4d60-b7f6-8d9a56be90bd/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}