{
  "storyId": "story-002-dragon-adventure",
  "sessionId": "edd24fb4-6ad8-4611-a61d-015b403884a6",
  "selectedVersions": {
    "1": {
      "version": 1,
      "generatedAt": "2026-01-10T10:48:22.702Z",
      "imagePath": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-01-v1.png"
    },
    "2": {
      "version": 1,
      "generatedAt": "2026-01-10T10:48:45.284Z",
      "imagePath": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-02-v1.png"
    },
    "3": {
      "version": 1,
      "generatedAt": "2026-01-10T10:49:07.956Z",
      "imagePath": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-03-v1.png"
    }
  },
  "regenerationCount": {
    "1": 1,
    "2": 1,
    "3": 1
  },
  "lastUpdated": "2026-01-10T10:49:07.956Z",
  "characterDescription": {
    "ageRange": "7-8 years old",
    "skinTone": "Light beige skin with neutral undertones, subtle pinkish cheeks, and slightly darker pigmentation around the eyes.",
    "eyeColor": "Bright sky blue with a darker blue limbal ring and very fine light grey speckling, slightly hooded eyelids.",
    "eyeShape": "Almond-shaped eyes, slightly upturned at the outer corners, fairly wide-set in relation to her nose width.",
    "hairColor": "Medium warm brown with natural subtle auburn highlights that are more noticeable in sunlight. Darker roots are visible.",
    "hairTexture": "Slightly wavy with natural volume and a tendency to frizz, medium thickness strands.",
    "hairStyle": "Varies in the photos. Can be long, past the shoulders, worn loose with a slight wave. In another photo, styled in two high pigtail buns secured with light pink scrunchies.",
    "faceShape": "Oval face with a broad forehead, soft jawline, and developing cheekbones, but retains some roundness in her cheeks. The overall face structure is starting to elongate.",
    "nose": "Small nose with a slightly rounded tip and a very subtly concave bridge, nostrils are small and delicately shaped.",
    "lips": "Medium-sized lips with a slightly fuller bottom lip, natural pink color with a subtle mauve undertone. The cupid's bow is well-defined.",
    "smile": "Wide, enthusiastic smile revealing the upper teeth, which show a noticeable gap between the front two incisors. The smile accentuates slight nasolabial folds.",
    "eyebrows": "Medium-thick eyebrows with a natural arch, slightly darker than her hair color, well-groomed and defined.",
    "ears": "Ears are mostly hidden but appear to be medium-sized and close to the head.",
    "cheeks": "Full cheeks that retain some baby fat, exhibiting a subtle pink flush, especially when smiling.",
    "chin": "Rounded, soft chin, proportionate to her face size.",
    "facialProportions": "Eyes are relatively large and prominent in relation to her face size. The lower half of the face is developing and starting to balance with the forehead area.",
    "distinctiveFeatures": "Noticeable gap between her upper front teeth. Subtle dark circles under her eyes. Slight asymmetry in the cheeks, more fullness on the left side. Her upper lip has a slight philtrum definition.",
    "overallImpression": "Sweet, cheerful, and energetic appearance. She has a youthful and playful look. The gap in her teeth adds to her endearing charm.",
    "fullDescription": "This girl is around 7-8 years old with light beige skin featuring neutral undertones and a hint of pink on her cheeks. Her bright sky blue, almond-shaped eyes, slightly upturned at the corners, are wide-set and framed by medium-thick, arched eyebrows slightly darker than her warm brown hair. Her slightly wavy, medium-thick hair features subtle auburn highlights, especially visible in sunlight, and has darker roots. She has a small nose with a gently rounded tip and a wide, enthusiastic smile, defined by medium-sized, pink lips revealing a noticeable gap between her upper front teeth, contributing to her sweet and cheerful expression. ",
    "generatedAt": "2026-01-10T10:48:01.231Z"
  },
  "styleReferenceImage": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-01-v1.png",
  "versionHistory": {
    "1": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:48:22.702Z",
        "imagePath": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-01-v1.png"
      }
    ],
    "2": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:48:45.284Z",
        "imagePath": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-02-v1.png"
      }
    ],
    "3": [
      {
        "version": 1,
        "generatedAt": "2026-01-10T10:49:07.956Z",
        "imagePath": "data/sessions/edd24fb4-6ad8-4611-a61d-015b403884a6/generated/page-03-v1.png"
      }
    ]
  },
  "favoriteVersions": {}
}